export const NoticeContent = {
    template: `<div>
                    <h5>แมพซี่ดอทคอม (mapcii.com)</h5>
                    <p style="text-indent: 40px; font-size: 1rem; text-align: justify;">
                        เราช่วยเพิ่มโอกาสในการขายอสังหาฯของคุณ ด้วยการลงโฆษณาผ่าน AD ประกาศ ซึ่งจะทำให้โฆษณาของคุณโดดเด่น สะดุดตา และค้นหาได้ง่าย พร้อมฟังก์ชั่นพิเศษในการแสดงราคาบนแผนที่
                        ที่จะกระพริบเปลี่ยนสีไปมา เพื่มดึงดูใจให้ลูกค้าคลิกเข้าไปดูอสังหาฯของคุณ ซึ่งจะเพิ่มโอกาสในการขายมากยิ่งขึ้น
                    </p>
                    <hr/>
                    <p class="mb-1">
                        <strong>สำหรับการลงโฆษณา "ประกาศ" ขายอสังหาฯนั้น เราจำแนกไว้ 3 ประเภทดังนี้</strong>
                    </p>
                    <ol class="pl-4" style="font-size: 0.9rem; line-height: 22px;">
                        <li class="mb-2"><strong style="font-size: 1rem;">อสังหาขายด่วน</strong> เหมาะสำหรับผู้ที่ร้อนเงิน ต้องการขายด่วนจริงๆ โดยที่เรากำหนดให้ผู้ที่ลงประกาศจะต้องพร้อมลดราคาอสังหาฯ จากราคาตลาดอย่างน้อย 20% ขึ้นไป ยิ่งลดมากยิ่งขายไว</li>
                        <li class="mb-2"><strong style="font-size: 1rem;">อสังหามือสอง</strong> เหมาะสำหรับผู้ที่ต้องการขายอสงหาฯมือสองทั่วไป โดยเรมีระบบที่ช่วยให้การขายอสังหาฯง่ายขึ้น เข้าถึงผู้ซื้อได้เร็วขึ้น</li>
                        <li class="mb-2"><strong style="font-size: 1rem;">โครงการใหม่</strong> เหมาะสำหรับขายอสังหาฯใหม่จากโครงการตั้งแต่ขนาดเล็ก จนถึงขนาดใหญ่ เราจะช่วยเพิ่มช่องทางการสื่อสารห้โครงการเป็นที่รู้จัก และเพิ่มยอดขายได้อย่างรวดเร็ว</li>
                    </ol>
                </div>`
}