<?php

namespace App\Controller\Component;

use Cake\Controller\Component;

class GolbalObjComponent extends Component {

    //Option data
    public function getStartPriceList() {
        $startPrice = [
            'sales' => [
                ['value' => '0', 'label' => 'ตั้งแต่ราคา 0'],
                ['value' => '500000', 'label' => 'ตั้งแต่ราคา 500,000'],
                ['value' => '1000000', 'label' => 'ตั้งแต่ราคา 1,000,000'],
                ['value' => '1500000', 'label' => 'ตั้งแต่ราคา 1,500,000'],
                ['value' => '2000000', 'label' => 'ตั้งแต่ราคา 2,000,000'],
                ['value' => '2500000', 'label' => 'ตั้งแต่ราคา 2,500,000'],
                ['value' => '3000000', 'label' => 'ตั้งแต่ราคา 3,000,000'],
                ['value' => '3500000', 'label' => 'ตั้งแต่ราคา 3,500,000'],
                ['value' => '4000000', 'label' => 'ตั้งแต่ราคา 4,000,000'],
                ['value' => '4500000', 'label' => 'ตั้งแต่ราคา 4,500,000'],
                ['value' => '5000000', 'label' => 'ตั้งแต่ราคา 5,000,000'],
                ['value' => '10000000', 'label' => 'ตั้งแต่ราคา 10,000,000'],
                ['value' => '20000000', 'label' => 'ตั้งแต่ราคา 20,000,000'],
                ['value' => '30000000', 'label' => 'ตั้งแต่ราคา 30,000,000'],
                ['value' => '50000000', 'label' => 'ตั้งแต่ราคา 50,000,000'],
                ['value' => '100000000', 'label' => 'ตั้งแต่ราคา 100,000,000']
            ],
            'rent' => [
                ['value' => '0', 'label' => 'ตั้งแต่ราคา 0'],
                ['value' => '1000', 'label' => 'ตั้งแต่ราคา 1,000'],
                ['value' => '2000', 'label' => 'ตั้งแต่ราคา 2,000'],
                ['value' => '3000', 'label' => 'ตั้งแต่ราคา 3,000'],
                ['value' => '4000', 'label' => 'ตั้งแต่ราคา 4,000'],
                ['value' => '5000', 'label' => 'ตั้งแต่ราคา 5,000'],
                ['value' => '6000', 'label' => 'ตั้งแต่ราคา 6,000'],
                ['value' => '7000', 'label' => 'ตั้งแต่ราคา 7,000'],
                ['value' => '8000', 'label' => 'ตั้งแต่ราคา 8,000'],
                ['value' => '9000', 'label' => 'ตั้งแต่ราคา 9,000'],
                ['value' => '10000', 'label' => 'ตั้งแต่ราคา 10,000'],
                ['value' => '20000', 'label' => 'ตั้งแต่ราคา 20,000'],
                ['value' => '30000', 'label' => 'ตั้งแต่ราคา 30,000'],
                ['value' => '40000', 'label' => 'ตั้งแต่ราคา 40,000'],
                ['value' => '50000', 'label' => 'ตั้งแต่ราคา 50,000'],
                ['value' => '100000', 'label' => 'ตั้งแต่ราคา 100,000']
            ]
        ];

        return $startPrice;
    }

    public function getEndPriceList() {
        $endPrice = [
            'sales' => [
                ['value' => '500000', 'label' => 'ถึงราคา 500,000'],
                ['value' => '1000000', 'label' => 'ถึงราคา 1,000,000'],
                ['value' => '1500000', 'label' => 'ถึงราคา 1,500,000'],
                ['value' => '2000000', 'label' => 'ถึงราคา 2,000,000'],
                ['value' => '2500000', 'label' => 'ถึงราคา 2,500,000'],
                ['value' => '3000000', 'label' => 'ถึงราคา 3,000,000'],
                ['value' => '3500000', 'label' => 'ถึงราคา 3,500,000'],
                ['value' => '4000000', 'label' => 'ถึงราคา 4,000,000'],
                ['value' => '4500000', 'label' => 'ถึงราคา 4,500,000'],
                ['value' => '5000000', 'label' => 'ถึงราคา 5,000,000'],
                ['value' => '10000000', 'label' => 'ถึงราคา 10,000,000'],
                ['value' => '20000000', 'label' => 'ถึงราคา 20,000,000'],
                ['value' => '30000000', 'label' => 'ถึงราคา 30,000,000'],
                ['value' => '50000000', 'label' => 'ถึงราคา 50,000,000'],
                ['value' => '10000000000', 'label' => 'ถึงราคาไม่จำกัด']
            ],
            'rent' => [
                ['value' => '1000', 'label' => 'ถึงราคา 1,000'],
                ['value' => '2000', 'label' => 'ถึงราคา 2,000'],
                ['value' => '3000', 'label' => 'ถึงราคา 3,000'],
                ['value' => '4000', 'label' => 'ถึงราคา 4,000'],
                ['value' => '5000', 'label' => 'ถึงราคา 5,000'],
                ['value' => '6000', 'label' => 'ถึงราคา 6,000'],
                ['value' => '7000', 'label' => 'ถึงราคา 7,000'],
                ['value' => '8000', 'label' => 'ถึงราคา 8,000'],
                ['value' => '9000', 'label' => 'ถึงราคา 9,000'],
                ['value' => '10000', 'label' => 'ถึงราคา 10,000'],
                ['value' => '20000', 'label' => 'ถึงราคา 20,000'],
                ['value' => '30000', 'label' => 'ถึงราคา 30,000'],
                ['value' => '40000', 'label' => 'ถึงราคา 40,000'],
                ['value' => '50000', 'label' => 'ถึงราคา 50,000'],
                ['value' => '100000', 'label' => 'ถึงราคา 100,000'],
                ['value' => '10000000000', 'label' => 'ถึงราคาไม่จำกัด']
            ]
        ];
        return $endPrice;
    }

}
